/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_pwd.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: swagstaf <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/04/15 16:58:07 by swagstaf          #+#    #+#             */
/*   Updated: 2021/04/16 15:26:27 by swagstaf         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "minishell.h"

void	ft_pwd(void)
{
	char	*res;

	g_error = 0;
	res = getcwd(NULL, 0);	//тут надо на нал проверять.
	ft_check_errno();
	printf("%s\n", res);
	free(res);
}
